#### Feature Scaling

In [1]:
import pandas as pd
import seaborn as sns

In [3]:
dataset=pd.read_excel("company.xlsx")
dataset.head(3)

    EEID   Name  Gender    Salary
0  EMP01  Arhaan       M      NaN
1  EMP02   Dayam       M  25000.0
2  EMP01    Anam     NaN  27000.0

In [4]:
dataset.isnull().sum()

EEID       0
Name       1
Gender     1
Salary     2
dtype: int64

In [5]:
dataset["Salary"].fillna(dataset["Salary"].mean(),inplace=True)

C:\Users\ARHAAN ARIF\AppData\Local\Temp\ipykernel_35012\3177769817.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["Salary"].fillna(dataset["Salary"].mean(),inplace=True)

In [6]:
dataset

    EEID   Name  Gender    Salary
0  EMP01  Arhaan       M  24250.0
1  EMP02   Dayam       M  25000.0
2  EMP01    Anam     NaN  27000.0
3  EMP04  Arhaan       M  20000.0
4  EMP05     NaN       F  25000.0
5  EMP06    Asif       M  24250.0